ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_adc.c
    tmpreg_CFG1 += ADCx_InitStruct->ADC_ClockSource
                 + ADCx_InitStruct->ADC_SamplingMode
                 + ADCx_InitStruct->ADC_ChannelSwitching
                 + (ADCx_InitStruct->ADC_ChannelNumber << ADC1_CFG_REG_CHS_Pos)
                 + ADCx_InitStruct->ADC_LevelControl
                 + ADCx_InitStruct->ADC_VRefSource
                 + ADCx_InitStruct->ADC_Prescaler
                 + (ADCx_InitStruct->ADC_DelayGo << ADC1_CFG_DELAY_GO_Pos);

    tmpreg_CFG2 = MDR_ADC->ADC2_CFG;
    tmpreg_CFG2 &= ~ADC2_CFG_ADC1_OP;
    tmpreg_CFG2 += ADCx_InitStruct->ADC_IntVRefSource << ADC2_CFG_ADC1_OP_Pos;


    MDR_ADC->ADC1_L_LEVEL = ADCx_InitStruct->ADC_LowLevel;
    MDR_ADC->ADC1_H_LEVEL = ADCx_InitStruct->ADC_HighLevel;
    MDR_ADC->ADC1_CHSEL   = ADCx_InitStruct->ADC_Channels;

    MDR_ADC->ADC1_CFG = tmpreg_CFG1;
    MDR_ADC->ADC2_CFG = tmpreg_CFG2;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Initializes the ADC2 peripheral according to
  *          the specified parameters in the ADCx_InitStruct.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   ADCx_InitStruct: pointer to a @ref ADCx_InitTypeDef structure
  *          that contains the configuration information for the ADC2
  *          peripheral.
  * @retval  None
  */
void ADC2_Init(const ADCx_InitTypeDef* ADCx_InitStruct)
{
    uint32_t tmpreg_CFG2;

    /* Check the parameters */
    assert_param(IS_ADC_CLOCK_SOURCE_CONFIG(ADCx_InitStruct->ADC_ClockSource));
    assert_param(IS_ADC_SAMPLING_MODE_CONFIG(ADCx_InitStruct->ADC_SamplingMode));
    assert_param(IS_ADC_CH_SWITCHING_CONFIG(ADCx_InitStruct->ADC_ChannelSwitching));
    assert_param(IS_ADC2_CH_NUM(ADCx_InitStruct->ADC_ChannelNumber));
    assert_param(IS_ADC2_CH_MASK(ADCx_InitStruct->ADC_Channels));
    assert_param(IS_ADC_LEVEL_CONTROL_CONFIG(ADCx_InitStruct->ADC_LevelControl));
    assert_param(IS_ADC_VALUE(ADCx_InitStruct->ADC_LowLevel));
    assert_param(IS_ADC_VALUE(ADCx_InitStruct->ADC_HighLevel));
    assert_param(IS_ADC_VREF_SOURCE_CONFIG(ADCx_InitStruct->ADC_VRefSource));
    assert_param(IS_ADC_INT_VREF_SOURCE_CONFIG(ADCx_InitStruct->ADC_IntVRefSource));
    assert_param(IS_ADC_CLK_div_VALUE(ADCx_InitStruct->ADC_Prescaler));
    assert_param(IS_ADC_DELAY_GO_VALUE(ADCx_InitStruct->ADC_DelayGo));

    tmpreg_CFG2 = MDR_ADC->ADC2_CFG;

    tmpreg_CFG2 &= ~(ADC2_CFG_REG_CLKS
                   | ADC2_CFG_REG_SAMPLE
                   | ADC2_CFG_REG_CHCH
                   | ADC2_CFG_REG_CHS_Msk
                   | ADC2_CFG_REG_RNGC
                   | ADC2_CFG_M_REF
                   | ADC2_CFG_ADC2_OP
                   | ADC2_CFG_REG_DIVCLK_Msk
                   | ADC2_CFG_DELAY_GO_Msk);

    tmpreg_CFG2 += ADCx_InitStruct->ADC_ClockSource
                 + ADCx_InitStruct->ADC_SamplingMode
                 + ADCx_InitStruct->ADC_ChannelSwitching
                 + (ADCx_InitStruct->ADC_ChannelNumber << ADC2_CFG_REG_CHS_Pos)
                 + ADCx_InitStruct->ADC_LevelControl
                 + ADCx_InitStruct->ADC_VRefSource
                 + (ADCx_InitStruct->ADC_IntVRefSource << ADC2_CFG_ADC2_OP_Pos)
                 + ADCx_InitStruct->ADC_Prescaler
                 + (ADCx_InitStruct->ADC_DelayGo << ADC2_CFG_DELAY_GO_Pos);

    MDR_ADC->ADC2_L_LEVEL = ADCx_InitStruct->ADC_LowLevel;
    MDR_ADC->ADC2_H_LEVEL = ADCx_InitStruct->ADC_HighLevel;
    MDR_ADC->ADC2_CHSEL   = ADCx_InitStruct->ADC_Channels;

    MDR_ADC->ADC2_CFG = tmpreg_CFG2;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Fills each ADCx_InitStruct member with its default value.
  * @param  ADCx_InitStruct: pointer to a @ref ADCx_InitTypeDef structure
  *         which will be initialized.
  * @retval None
  */
void ADCx_StructInit(ADCx_InitTypeDef* ADCx_InitStruct)
{
    ADCx_InitStruct->ADC_ClockSource      = ADC_CLOCK_SOURCE_CPU;
    ADCx_InitStruct->ADC_SamplingMode     = ADC_SAMPLING_MODE_SINGLE_CONV;
    ADCx_InitStruct->ADC_ChannelSwitching = ADC_CH_SWITCHING_Disable;
    ADCx_InitStruct->ADC_ChannelNumber    = ADC_CH_ADC0;
    ADCx_InitStruct->ADC_Channels         = 0;
    ADCx_InitStruct->ADC_LevelControl     = ADC_LEVEL_CONTROL_Disable;
    ADCx_InitStruct->ADC_LowLevel         = 0;
    ADCx_InitStruct->ADC_HighLevel        = 0;
    ADCx_InitStruct->ADC_VRefSource       = ADC_VREF_SOURCE_INTERNAL;
    ADCx_InitStruct->ADC_IntVRefSource    = ADC_INT_VREF_SOURCE_INEXACT;
    ADCx_InitStruct->ADC_Prescaler        = ADC_CLK_div_None;
    ADCx_InitStruct->ADC_DelayGo          = 0;
}

/**
  * @brief  Enables or disables the ADC1 peripheral.
  * @param  NewState - @ref FunctionalState - new state of the ADC1 peripheral.
  * @retval None
  */
void ADC1_Cmd(FunctionalState NewState)
{
    uint32_t tmpreg_CFG;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_CFG = MDR_ADC->ADC1_CFG;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable ADC1 by setting the Cfg_REG_ADON bit in the ADC1_CFG register */
        tmpreg_CFG |= ADC1_CFG_REG_ADON;
    }
    else
    {
        /* Disable ADC1 by resetting the Cfg_REG_ADON bit in the ADC1_CFG register */
        tmpreg_CFG &= ~ADC1_CFG_REG_ADON;
    }

    /* Configure ADC1_CFG register with new value */
    MDR_ADC->ADC1_CFG = tmpreg_CFG;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Enables or disables the ADC1 peripheral.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   NewState - @ref FunctionalState - new state of the ADC1 peripheral.
  * @retval  None
  */
void ADC2_Cmd(FunctionalState NewState)
{
    uint32_t tmpreg_CFG;

    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_CFG = MDR_ADC->ADC2_CFG;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable ADC2 by setting the Cfg_REG_ADON bit in the ADC2_CFG register */
        tmpreg_CFG |= ADC2_CFG_REG_ADON;
    }
    else
    {
        /* Disable ADC2 by resetting the Cfg_REG_ADON bit in the ADC2_CFG register */
        tmpreg_CFG &= ~ADC2_CFG_REG_ADON;
    }

