ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_adc.c
    MDR_ADC->ADC2_L_LEVEL = LowLevel;
    MDR_ADC->ADC2_H_LEVEL = HighLevel;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Sets the ADC1 low level.
  * @param  LowLevel: specifies the ADC1 low level value.
  * @retval None
  */
void ADC1_SetLowLevel(uint32_t LowLevel)
{
    /* Check the parameters */
    assert_param(IS_ADC_VALUE(LowLevel));

    MDR_ADC->ADC1_L_LEVEL = LowLevel;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Sets the ADC2 low level.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   LowLevel: specifies the ADC2 low level value.
  * @retval  None
  */
void ADC2_SetLowLevel(uint32_t LowLevel)
{
    /* Check the parameters */
    assert_param(IS_ADC_VALUE(LowLevel));

    MDR_ADC->ADC2_L_LEVEL = LowLevel;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Sets the ADC1 high level.
  * @param  HighLevel: specifies the ADC1 high level value.
  * @retval None
  */
void ADC1_SetHighLevel(uint32_t HighLevel)
{
    /* Check the parameters */
    assert_param(IS_ADC_VALUE(HighLevel));

    MDR_ADC->ADC1_H_LEVEL = HighLevel;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Sets the ADC2 high level.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   HighLevel: specifies the ADC2 high level value.
  * @retval  None
  */
void ADC2_SetHighLevel(uint32_t HighLevel)
{
    /* Check the parameters */
    assert_param(IS_ADC_VALUE(HighLevel));

    MDR_ADC->ADC2_H_LEVEL = HighLevel;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Starts the ADC1 conversion.
  * @param  None.
  * @retval None.
  */
void ADC1_Start(void)
{
    MDR_ADC->ADC1_CFG |= ADC1_CFG_REG_GO;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Starts the ADC2 conversion.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   None.
  * @retval  None.
  */
void ADC2_Start(void)
{
    MDR_ADC->ADC2_CFG |= ADC2_CFG_REG_GO;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Returns the ADC1 result.
  * @param  None.
  * @retval ADC1 Result Register value.
  */
uint32_t ADC1_GetResult(void)
{
    return MDR_ADC->ADC1_RESULT;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Returns the ADC2 result.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   None.
  * @retval  ADC2 Result Register value.
  */
uint32_t ADC2_GetResult(void)
{
    return MDR_ADC->ADC2_RESULT;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Returns the ADC1, ADC2 Status Registers combined value.
  * @param  None.
  * @retval The ADC1_STATUS, ADC2_STATUS Registers combined value.
  */
uint32_t ADC_GetStatus(void)
{
#if defined  (USE_MDR32F9Q2I)|| defined (USE_MDR32FG16S1QI)
    return MDR_ADC->ADC1_STATUS + (MDR_ADC->ADC2_STATUS << 16);
#elif defined (USE_MDR32F1QI)
    return MDR_ADC->ADC1_STATUS;
#endif
}

/**
  * @brief  Returns the ADC1 Status Register value.
  * @param  None.
  * @retval The ADC1_STATUS Register value.
  */
uint32_t ADC1_GetStatus(void)
{
    return MDR_ADC->ADC1_STATUS;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Returns the ADC2 Status Register value.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   None.
  * @retval  The ADC2_STATUS Register value.
  */
uint32_t ADC2_GetStatus(void)
{
    return MDR_ADC->ADC2_STATUS;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Checks whether the specified ADC1, ADC2 Status flag is set or not.
  * @param  Flag - @ref ADC_Flags - specifies the flag to check.
  * @retval @ref FlagStatus - Current Status flag state (SET or RESET).
  */
FlagStatus ADC_GetFlagStatus(ADC_Flags Flag)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_ADC_STATUS_FLAG(Flag));

    if ((ADC_GetStatus() & (uint32_t)Flag) == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}

/**
  * @brief  Checks whether the specified ADC1 Status flag is set or not.
  * @param  Flag - @ref ADCx_Flags - specifies the flag to check.
  * @retval @ref FlagStatus - Current Status flag state (SET or RESET).
  */
FlagStatus ADC1_GetFlagStatus(ADCx_Flags Flag)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_ADCx_STATUS_FLAG(Flag));

    if ((MDR_ADC->ADC1_STATUS & (uint32_t)Flag) == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Checks whether the specified ADC2 Status flag is set or not.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   Flag - @ref ADC_Flags - specifies the flag to check.
  * @retval  @ref FlagStatus - Current Status flag state (SET or RESET).
  */
FlagStatus ADC2_GetFlagStatus(ADCx_Flags Flag)
{
    FlagStatus bitstatus;

    /* Check the parameters */
    assert_param(IS_ADCx_STATUS_FLAG(Flag));

    if ((MDR_ADC->ADC2_STATUS & (uint32_t)Flag) == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Clears the ADC1 Overwrite flag.
  * @param  None.
  * @retval None
  */
void ADC1_ClearOverwriteFlag(void)
{
    MDR_ADC->ADC1_STATUS &= ~ADCx_FLAG_OVERWRITE;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Clears the ADC2 Overwrite flag.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   None.
  * @retval  None
  */
void ADC2_ClearOverwriteFlag(void)
{
    MDR_ADC->ADC2_STATUS &= ~ADCx_FLAG_OVERWRITE;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)) */

/**
  * @brief  Clears the ADC1 AWOIFEN flag.
  * @param  None.
  * @retval None
  */
void ADC1_ClearOutOfRangeFlag(void)
{
    MDR_ADC->ADC1_STATUS &= ~ADCx_FLAG_OUT_OF_RANGE;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Clears the ADC2 AWOIFEN flag.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   None.
  * @retval  None
  */
void ADC2_ClearOutOfRangeFlag(void)
{
    MDR_ADC->ADC2_STATUS &= ~ADCx_FLAG_OUT_OF_RANGE;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Enables or disables the ADC1, ADC2 interrupts.
  * @param  ADC_IT - @ref ADC_IT_Def - specifies the ADC interrupts sources to be enabled or disabled.
  * @param  NewState - @ref FunctionalState - new state of the ADC interrupts (ENABLE or DISABLE).
  * @retval None
  */
void ADC_ITConfig(ADC_IT_Def ADC_IT, FunctionalState NewState)
{
    uint32_t tmpreg_ADC1_IE;
    uint32_t tmpreg_ADC_IT;
#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    uint32_t tmpreg_ADC2_IE;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

    /* Check the parameters */
    assert_param(IS_ADC_CONFIG_IT(ADC_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_ADC1_IE = MDR_ADC->ADC1_STATUS;
    tmpreg_ADC_IT = (uint32_t)ADC_IT << 2;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the ADC Interrupt requests by setting bits in the ADCx_STATUS registers */
        tmpreg_ADC1_IE |= tmpreg_ADC_IT & 0xFFFF;
    }
    else
    {
        /* Disable the ADC Interrupt requests by clearing bits in the ADCx_STATUS registers */
        tmpreg_ADC1_IE &= ~(tmpreg_ADC_IT & 0xFFFF);
    }

    /* Configure ADCx_STATUS registers with new value */
    MDR_ADC->ADC1_STATUS = tmpreg_ADC1_IE;

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)

    tmpreg_ADC2_IE = MDR_ADC->ADC2_STATUS;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the ADC Interrupt requests by setting bits in the ADCx_STATUS registers */
        tmpreg_ADC2_IE |= tmpreg_ADC_IT >> 16;
    }
    else
    {
        /* Disable the ADC Interrupt requests by clearing bits in the ADCx_STATUS registers */
        tmpreg_ADC2_IE &= ~(tmpreg_ADC_IT >> 16);
    }
    /* Configure ADCx_STATUS registers with new value */
    MDR_ADC->ADC2_STATUS = tmpreg_ADC2_IE;
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */
}

/**
  * @brief  Enables or disables the ADC1 interrupts.
  * @param  ADC_IT - @ref ADC_IT_Def - specifies the ADC1 interrupts sources to be enabled or disabled.
  * @param  NewState - @ref FunctionalState - new state of the ADC1 interrupts (ENABLE or DISABLE).
  * @retval None
  */
void ADC1_ITConfig(ADC_IT_Def ADC_IT, FunctionalState NewState)
{
    uint32_t tmpreg_ADC1_IE;

    /* Check the parameters */
    assert_param(IS_ADCx_CONFIG_IT(ADC_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_ADC1_IE = MDR_ADC->ADC1_STATUS;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the ADC Interrupt requests by setting bits in the ADC1_STATUS register */
        tmpreg_ADC1_IE |= ((uint32_t)ADC_IT << 2);
    }
    else
    {
        /* Disable the ADC Interrupt requests by clearing bits in the ADC1_STATUS register */
        tmpreg_ADC1_IE &= ~((uint32_t)ADC_IT << 2);
    }

    /* Configure ADC1_STATUS registers with new value */
    MDR_ADC->ADC1_STATUS = tmpreg_ADC1_IE;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Enables or disables the ADC2 interrupts.
  * @warning This function can be used only for microcontroller series
  *          MDR32F9Q2I and MDR32FG16S1QI.
  * @param   ADC_IT - @ref ADC_IT_Def - specifies the ADC2 interrupts sources to be enabled or disabled.
  * @param   NewState - @ref FunctionalState - new state of the ADC2 interrupts (ENABLE or DISABLE).
  * @retval  None
  */
void ADC2_ITConfig(ADC_IT_Def ADC_IT, FunctionalState NewState)
{
    uint32_t tmpreg_ADC2_IE;

    /* Check the parameters */
    assert_param(IS_ADCx_CONFIG_IT(ADC_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    tmpreg_ADC2_IE = MDR_ADC->ADC2_STATUS;

    /* Form new value */
    if (NewState != DISABLE)
    {
        /* Enable the ADC Interrupt requests by setting bits in the ADC2_STATUS register */
        tmpreg_ADC2_IE |= ((uint32_t)ADC_IT << 2);
    }
    else
    {
        /* Disable the ADC Interrupt requests by clearing bits in the ADC2_STATUS register */
        tmpreg_ADC2_IE &= ~((uint32_t)ADC_IT << 2);
    }

