ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/src/MDR32FxQI_adc.c
    /* Configure ADC2_STATUS registers with new value */
    MDR_ADC->ADC2_STATUS = tmpreg_ADC2_IE;
}
#endif /* #if defined  (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/**
  * @brief  Checks whether the ADC1, ADC2 interrupt has occurred or not.
  * @param  ADC_IT - @ref ADC_IT_Def - specifies the ADC interrupt source to check.
  * @retval @ref ITStatus - Current state of the ADC_IT (SET or RESET).
  */
ITStatus ADC_GetITStatus(ADC_IT_Def ADC_IT)
{
    ITStatus bitstatus;
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_ADC_CONFIG_IT(ADC_IT));

    tmpreg = ADC_GetStatus();
    tmpreg &= (tmpreg >> 2) & (uint32_t)ADC_IT;

    if (tmpreg == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}

/**
  * @brief  Checks whether the ADC1 interrupt has occurred or not.
  * @param  ADC_IT - @ref ADC_IT_Def - specifies the ADC interrupt source to check.
  * @retval @ref ITStatus - Current state of the ADC_IT (SET or RESET).
  */
ITStatus ADC1_GetITStatus(ADC_IT_Def ADC_IT)
{
    ITStatus bitstatus;
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_ADCx_CONFIG_IT(ADC_IT));

    tmpreg = MDR_ADC->ADC1_STATUS;
    tmpreg &= (tmpreg >> 2) & (uint32_t)ADC_IT;

    if (tmpreg == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

  return bitstatus;
}

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
/**
  * @brief   Checks whether the ADC2 interrupt has occurred or not.
  * @warning This function can be used only for microcontroller
  *          MDR32F9Q2I and MDR32FG16S1QI
  * @param   ADC_IT - @ref ADC_IT_Def - specifies the ADC interrupt source to check.
  * @retval  @ref ITStatus - Current state of the ADC_IT (SET or RESET).
  */
ITStatus ADC2_GetITStatus(ADC_IT_Def ADC_IT)
{
    ITStatus bitstatus;
    uint32_t tmpreg;

    /* Check the parameters */
    assert_param(IS_ADCx_CONFIG_IT(ADC_IT));

    tmpreg = MDR_ADC->ADC2_STATUS;
    tmpreg &= (tmpreg >> 2) & (uint32_t)ADC_IT;

    if (tmpreg == 0)
    {
        bitstatus = RESET;
    }
    else
    {
        bitstatus = SET;
    }

    return bitstatus;
}
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

/** @} */ /* End of group ADC_Private_Functions */

/** @} */ /* End of group ADC */

/** @} */ /* End of group __MDR32FxQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2022 Milandr ****************************
*
* END OF FILE MDR32FxQI_adc.c */


